t = {"ё": 'yo', "а": 'a', "б": 'b', "в": 'v', "г": 'g', "д": 'd', "е": 'e', "ж": 'zh', "з": 'z', "и": 'i', "й": 'y',
"к": 'k', "л": 'l', "м": 'm', "н": 'n', "о": 'o', "п": 'p', "р": 'r', "с": 's', "т": 't', "у": 'u', "ф": 'f',
"х": 'h', "ц": 'c', "ч": 'ch', "ш": 'sh', "щ": 'shch', "ъ": '', "ы": 'y', "ь": '', "э": 'e', "ю": 'yu', "я": 'ya'}

s = input("Введите строку: ")
s = s.lower()
for i in range(len(s)):
    for i in ' ?!:;':
        s = s.replace(i, '-')

for i in s:
    if i in t:
        s = s.replace(i, t[i])
print(s)